OpenFOAM/hotfluidheater/system/heater/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    minY
    {
        type            patch;
        inGroups        (coupleGroup);
    }
    minZ
    {
        type            patch;
    }
    maxZ
    {
        type            patch;
    }
}

T
{
    internalField   uniform 300;

    boundaryField
    {
        ".*"
        {
            type            zeroGradient;
            value           uniform 300;
        }
       "heater_to_.*"
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
            value           uniform 300;
        }

       // heater_to_leftSolid
        //{
          //  type            compressible::turbulentTemperatureCoupledBaffleMixed;
            //Tnbr            T;
           // kappaMethod     solidThermo;
            //thicknessLayers (1e-3);
           // kappaLayers     (5e-4);
           // value           uniform 300;
        //}

       // minY
       // {
         //   type            fixedValue;
           // value           uniform 300;
       // }
    }
}

// ************************************************************************* //
